Revit 2027 API
SizingOptions Properties
The SizingOptions type exposes the following members.
Properties
Name | Description
Area |  The area of the specified sizing profile and dimension.
Density |  The air or fluid density in kg/ft^3, defaults to the dry air density at 20ºC.
Diameter |  The diameter of round duct or pipe in feet.
DomainType |  The domain type of the options, such as HVAC or Plumbing.
Height |  The height of the duct or pipe in feet.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaxSize |  The maximal size in feet, defaults to 2 feet.
MinSize |  The minimal size in feet, defaults to 0.041666 ft (0.5 inch).
ProfileType |  The profile type of the options, such as round, rectangular or oval.
Roughness |  The material roughness in ft, defaults to 0.0003 ft.
Viscosity |  The air or fluid viscosity in kg/(ft*s), defaults to the air dynamic viscosity at 20ºC.
Width |  The width of the duct or pipe in feet.
Top
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace